// book_module8.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <memory>
#include "book.h"

int main()
{
	Book first_book{ "Revizor", "N.V. Gogol", 1836 };
	auto  shptr_book = std::shared_ptr<Book>(new Book{ "Harry Potter and the Philosopher's Stone", "J.K.Rowling", 1997 });
	first_book.printInfo();
	shptr_book->printInfo();
	Book third_book;
	third_book.setTitle("The Little Prince");
	third_book.setAuthor("Saint-Exupery");
	third_book.setYear(1943);
	third_book.printInfo();

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
