// zad3.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <ctime>
#include "random.h"
int main()
{
	srand(time(0));
	int summa = 0;
	
	for (int i = 0; i <= 100; i++) {
		
		int first = random_number1();
		int second = random_number2();
		std::cout << first << "     " << second<<std::endl;
		summa = summa + first + second;
		if (summa >= 50) {
			std::cout << "There is a winner!" << std::endl;
			break;
		}
		if (i >= 100) {
			std::cout << "Nobody win" << std::endl;
		}
	}
	
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
